08-rails/moma/app/views/works/show.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  <li>Title: <%= @work.title %></li>
  <% if @work.artist.present? %>