08-rails/moma/app/controllers/artists_controller.rb

  def create
    artist = Artist.create artist_params
---
INSERT INTO "artists" ("name", "nationality", "period", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ken Done is Jonny's BFF"], ["nationality", ""], ["period", ""], ["image", ""], ["created_at", "2021-10-20 01:43:16.933425"], ["updated_at", "2021-10-20 01:43:16.933425"]]

  def update
    artist = Artist.find params[:id]
    artist.update artist_params
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "artists" SET "period" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["period", "Nothing"], ["updated_at", "2021-10-20 03:19:15.879102"], ["id", 8]]

  def destroy
    artist = Artist.find params[:id]
    artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 7]]