08-rails/moma/app/controllers/works_controller.rb

  def create
    work = Work.create work_params
---
INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    work = Work.find params[:id]
    work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "works" SET "artist_id" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["artist_id", 19], ["updated_at", "2021-10-20 05:22:29.152569"], ["id", 10]]

  def destroy
    work = Work.find params[:id]
    work.destroy
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 8]]