08-rails/solar_system/app/controllers/planets_controller.rb

  def show
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def create
    planet = Planet.create :name => params[:name], :image => params[:image], :orbit => params[:orbit], :diameter => params[:diameter], :mass => params[:mass], :moons => params[:moons]
---
INSERT INTO "planets" ("name", "image") VALUES (?, ?)  [["name", "Mercury"], ["image", "https://upload.wikimedia.org/wikipedia/commons/4/4a/Mercury_in_true_color.jpg"]]

  def edit
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

  def update
    planet = Planet.find params[:id]
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.save
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "planets" SET "image" = ? WHERE "planets"."id" = ?  [["image", "https://news.uchicago.edu/sites/default/files/images/image/20170123/moonandearthlroearthriseframe0.jpg"], ["id", 11]]

  def destroy
    planet = Planet.find params[:id]
    planet.destroy # Alderaan!!
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 18]]