08-rails/tunr/app/controllers/mixtapes_controller.rb

INSERT INTO "mixtapes" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Fight Me, Beethoven"], ["created_at", "2021-10-21 23:07:40.871901"], ["updated_at", "2021-10-21 23:07:40.871901"]]
---
  def create
    mixtape = Mixtape.create mixtape_params