08-rails/tunr/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["email", ""], ["created_at", "2021-10-21 03:51:22.307298"], ["updated_at", "2021-10-21 03:51:22.307298"], ["password_digest", "$2a$12$wTPVYerKPpBwD1JfP3G6eOd6fwW1M/zgVl1hDWRetjMVPLRXFQm5m"]]
---
  def create
    @user = User.new user_params
    if @user.save